app/controllers/consumibles_controller.rb

SELECT "consumibles".* FROM "consumibles"
---
  def index
    @consumibles = Consumible.all

INSERT INTO "consumibles" ("cantidad", "created_at", "descripcion", "dimensiones", "material", "nombre", "responsable", "ubicacion", "updated_at", "uso") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @consumible = Consumible.new(consumible_params)
	respond_to do |format|
		if @consumible.save

UPDATE "consumibles" SET "dimensiones" = $1, "updated_at" = $2 WHERE "consumibles"."id" = 4  [["dimensiones", "wadawd"], ["updated_at", "2014-10-10 18:01:32.067389"]]
---
  def update
    respond_to do |format|
      if @consumible.update(consumible_params)

DELETE FROM "consumibles" WHERE "consumibles"."id" = $1  [["id", 2]]
---
  def destroy
    @consumible.destroy

SELECT  "consumibles".* FROM "consumibles"  WHERE "consumibles"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_consumible
      @consumible = Consumible.find(params[:id])