app/controllers/equipos_controller.rb

  def index
    @equipos = Equipo.all
---
SELECT "equipos".* FROM "equipos"

  def create
    @equipo = Equipo.new(equipo_params)
    respond_to do |format|
		if @equipo.save
---
INSERT INTO "equipos" ("costo", "created_at", "factura", "fecha_adquisicion", "marca", "modelo", "no_bien_nac", "nombre", "orden_compra", "responsable", "serial", "status", "ubicacion", "ultima_calibracion", "updated_at", "uso") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
	  respond_to do |format|
      if @equipo.update(equipo_params)
---
UPDATE "equipos" SET "Docencia" = $1, "Extension" = $2, "Gestion" = $3, "updated_at" = $4 WHERE "equipos"."id" = 1  [["Docencia", "t"], ["Extension", "f"], ["Gestion", "f"], ["updated_at", "2014-10-17 15:28:31.372420"]]

  def destroy
    @equipo.destroy
---
DELETE FROM "equipos" WHERE "equipos"."id" = $1  [["id", 1]]

    def set_equipo
      @equipo = Equipo.find(params[:id])
---
SELECT  "equipos".* FROM "equipos"  WHERE "equipos"."id" = $1 LIMIT 1  [["id", 8]]