app/controllers/instrumentos_controller.rb

SELECT "instrumentos".* FROM "instrumentos"
---
  def index
    @instrumentos = Instrumento.all

INSERT INTO "instrumentos" ("capacidad", "created_at", "estado", "marca", "material", "modelo", "no_bien_nac", "nombre", "responsable", "ubicacion", "ultima_calibracion", "unidad_medida", "updated_at", "uso") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @instrumento = Instrumento.new(instrumento_params)
    respond_to do |format|
		if @instrumento.save

UPDATE "instrumentos" SET "capacidad" = $1, "updated_at" = $2 WHERE "instrumentos"."id" = 1  [["capacidad", 0.0], ["updated_at", "2014-10-10 19:53:54.874833"]]
---
  def update
	  respond_to do |format|
		if @instrumento.update(instrumento_params)

DELETE FROM "instrumentos" WHERE "instrumentos"."id" = $1  [["id", 1]]
---
  def destroy
    @instrumento.destroy

SELECT  "instrumentos".* FROM "instrumentos"  WHERE "instrumentos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_instrumento
      @instrumento = Instrumento.find(params[:id])