app/controllers/sustancia_quimicas_controller.rb

SELECT "sustancia_quimicas".* FROM "sustancia_quimicas"
---
  def index
    @sustancia_quimicas = SustanciaQuimica.all

INSERT INTO "sustancia_quimicas" ("CAS", "caducidad", "cantidad", "controlado", "created_at", "estado_materia", "nombre", "peligro", "pureza", "regimen_legal", "responsable", "status", "ubicacion", "updated_at", "uso") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @sustancia_quimica = SustanciaQuimica.new(sustancia_quimica_params)
    respond_to do |format|
		if @sustancia_quimica.save