app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("apellido", "created_at", "laboratorio", "nombre", "updated_at", "usbid") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

DELETE FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 2]]
---
  def destroy
    @usuario.destroy